#include <stdio.h>

int main()
{
/*	int i,j;
	int a = 0;
	int ar[6][9] = {{0,0,0,1,0,0,0,0,0},
					{0,0,0,0,0,0,0,2,0},
					{0,0,0,0,1,0,0,0,0},
					{0,2,0,1,0,0,1,0,0},
					{0,0,0,1,0,0,0,0,0},
					{0,0,1,0,0,0,1,0,0},
					};
					
	for (i = 0;i < 6;i++)
	{
		for (j = 0;j < 9;j++)
		{
			printf("%d",ar[i][j]);
			if (ar[i][j] == 1)
			{
				a = a + 1;
			}
		}
		printf("\n");
	}
					
	printf("배열에서 1은 총%d개 입니다.",a);*/
	
/*	int i,j;
	int a = 0;
	int ar[6][9] = {{0,0,0,1,0,0,0,0,0},
					{0,0,0,0,0,0,0,2,0},
					{0,0,0,0,1,0,0,0,0},
					{0,2,0,1,0,0,1,0,0},
					{0,0,0,1,0,0,0,0,0},
					{0,0,1,0,0,0,1,0,0},
					};
					
	for (i = 0;i < 6;i++)
	{
		for (j = 0;j < 9;j++)
		{
			if (ar[i][j] == 2)
			{
				printf("  2의 위치는:%d %d  \n",i,j);
				ar[i-1][j] = 5;
				ar[i+1][j] = 5;
				ar[i][j-1] = 5;
				ar[i][j+1] = 5;
			}
		}
	}
	
	for (i = 0;i < 6;i++)
	{
		for (j = 0;j < 9;j++)
		{
			printf("%d",ar[i][j]);
		}
		printf("\n");
	}*/
	
/*	int i,j;
	int a = 0;
	int ar[6][9] = {{0,0,0,1,0,0,0,0,0},
					{0,0,0,0,0,0,0,2,0},
					{0,0,0,0,1,0,0,0,0},
					{0,2,0,1,0,0,1,0,0},
					{0,0,0,1,0,0,0,0,0},
					{0,0,1,0,0,0,1,0,0},
					};
					
	for (i = 0;i < 6;i++)
	{
		for (j = 0;j < 9;j++)
		{
			if (ar[i][j] == 0)
			{
				ar[i][j] = 1;
			}
			else
			{
				ar[i][j] = 0;
			}
			printf("%d",ar[i][j]);
		}
		printf("\n");
	}*/
	
	int i,j;
	int d=0;
	int b=0;
	int e;
	int t=0;
	int a[6][5] = {{23,22,27,21,24},
					{21,22,25,24,21},
					{20,23,22,21,24},
					{25,26,23,27,28},
					{26,24,28,29,26},
					{27,28,29,26,27}};
	
	for (i=0;i<6;i++)
	{
		printf("     %d반 %d반 %d반 %d반 %d반",1,2,3,4,5);
		printf("\n");
		printf("%d학년",i+1);
		for (j=0;j<5;j++)
		{
			printf(" %d ",a[i][j]);
		}
		printf("\n");
	}
	printf("\n학년을 입력하세요:");
	scanf("%d",&e);
	
	printf("\n     %d반 %d반 %d반 %d반 %d반",1,2,3,4,5);
	printf("\n");
	printf("%d학년",e);
	for (j=0;j<5;j++)
	{
		printf(" %d ",a[e-1][j]);
		t = t + a[e-1][j];
	}
	printf("총합:%d",t);
	
	printf("\n\n반을 입력하세요:");
	scanf("%d",&e);
	
	printf("      %d반\n",e);
	for (j=0;j<6;j++)
	{
		t = 0;
		printf("%d학년  %d\n",j+1,a[j][e]);
		t = t + a[j][e];
	}
	printf("총합:%d",t);
	
	return 0;	
}
